Repository: Sawiq/pykpc
Catalog: locale/*/LC_MESSAGES/pykpc.po
Languages: pl

source: User manual
pl: Podręcznik użytkownika

source: Detecting pump...
pl: Wykrywanie pompy...

source: &Connect with the pump Ctrl+P
pl: &Połącz z pompą Ctrl+P

source: &User manual
pl: P&odręcznik użytkownika

source: &File
pl: &Plik

source: &Help
pl: &Pomoc

source: Flow
pl: Przepływ

source: &Set
pl: &Ustaw

source: Timer
pl: Odliczanie

source: &Manual measurement.
pl: Pomiar &ręczny

source: Start accusition when &counting down ends.
pl: Rozpocznij pomiar po zakończeniu &odliczania

source: Start accusition after sample &injection
pl: Rozpocznij pomiar po nastrzyku

source: Start c&ounting down after sample injection
pl: Rozpocznij &odliczanie po nastrzyku

source: Start &flow during sample load.
pl: Włącz &przepływ podczas wprowadzania próbki

source: &Turn flow ON
pl: &Włącz przepływ

source: Program for controlling Knauer Azura P2.1S pump over serial port. Author: Sawik psawicki@mitr.p.lodz.pl
pl: Program sterujący pompą Knauer Azura P2.1S za pomocą portu szeregowego. Autor: Sawik psawicki@mitr.p.lodz.pl

source: About
pl: O programie

source: Flow is turned ON
pl: Przepływ włączony

source: Turn flow OFF
pl: Wyłącz przepływ

source: Flow is turned OFF
pl: Przepływ wyłączony

source: Turn flow ON
pl: Włącz przepływ

source: Flow: {}
pl: Przepływ: {}

source: Counting down aborted.
pl: Zatrzymano odliczanie.

source: Flow will stop in {} s
pl: Zatrzymanie przepływu za {} s

source: Flow is stopped.
pl: Zatrzymano przepływ.

source: Connection failed
pl: Błąd połączenia

source: No device connected!
pl: Nie wykryto żadnych urządzeń!

source: Connection error!
pl: Błąd połączenia!

source: Flow limits: {} - {}
pl: Granice przepływu: {} - {}

source: Pump
pl: Pompa
