Repository: Sawiq/pykpc
Catalog: locale/*/pykpc.po
Languages: de

source: User manual
de: Bedienungsanleitung

source: Detecting pump...
de: Pumpeerkenung...

source: &Connect with the pump Ctrl+P
de: &Herstell Verbindung mit den Pumpe Ctrl+P

source: &User manual
de: &Bedienungsanleitung

source: &File
de: &Datei

source: &Help
de: &Hilfe

source: Flow
de: Fluss

source: &Set
de: &Einstellen

source: Timer
de: Schaltuhr

source: &Manual measurement.
de: &Manuelle Messung.

source: Start &flow during sample load.
de: Start der fluss, wenn die Probe eingeladen werde.

source: &Turn flow ON
de: &Fluss einshalten

source: About
de: Über das Programm

source: Flow is turned ON
de: Fluss ist eingeshaltet

source: Turn flow OFF
de: Fluss abshalten

source: Flow is turned OFF
de: Fluss ist abgeshaltet

source: Turn flow ON
de: &Fluss einshalten

source: Flow: {}
de: Fluss: {}

source: Counting down aborted.
de: Countdown abgebrochen.

source: Flow will stop in {} s
de: Fluss will in {} s stoppen

source: Flow is stopped.
de: Fluss wurde gestopped.

source: Connection failed
de: Verbindung fehlgeschlagen

source: No device connected!
de: Kein Gerät verbunden!

source: Connection error!
de: Verbindungsfehler!

source: Flow limits: {} - {}
de: Flusslimit: {} - {}

source: Pump
de: Pumpe
